КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Время по МСК!</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыТитулов</types>
    </type>
  </resources>
  <resources>
    <name>СтатусПодписи</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписи</types>
    </type>
  </resources>
  <resources>
    <name>ТипОшибки</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыОшибокСтатусаТитула</types>
    </type>
  </resources>
  <resources>
    <name>КодОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь1С</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГП</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2_5_02</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГО</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ДФ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭкспедиторскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул7</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул6</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул8</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СкладскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулПВ</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул6</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыЛогистическихДокументов/КонтурЛогистика_ТипыЛогистическихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыЛогистическихДокументов</name>
  <enumValues>
    <name>ТрН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул7</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул8</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул7</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул8</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул9</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЭкспедиторскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>СкладскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>ПЭ_ЗаявкаНаМаршрут</name>
  </enumValues>
  <enumValues>
    <name>ПЭ_Титул1</name>
    <comment>Поручение экспедитору (ПЭ). Титул1 (ON_POREXPKLT)</comment>
  </enumValues>
  <enumValues>
    <name>ПЭ_Титул2</name>
    <comment>Поручение экспедитору (ПЭ). Титул2 (подтверждение)</comment>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5_5_02</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_СтатусыТитулов/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ОтборДокумент) Тогда
		ОтборДокумент = Параметры.ОтборДокумент;
		
		Если ТипЗнч(ОтборДокумент) = Тип("ДокументСсылка.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут") Тогда
			ОтборДокумент = ОтборДокумент.Титул1;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьПараметрыДинамическогоСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.СписокГлавныйГруппаПодробно.Видимость = Ложь;
	
	ОбновитьКартинкиКомандПоказа();
	
КонецПроцедуры

&НаСервере
Процедура ОтборДокументПриИзмененииНаСервере()
	
	ОбновитьПараметрыДинамическогоСписка();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПараметрыДинамическогоСписка()
	
	Перем ДокументГлавный, ДокументТитул;
	
	Если ЗначениеЗаполнено(ОтборДокумент) Тогда 
		
		Если ТипЗнч(ОтборДокумент) = Тип("ДокументСсылка.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная") Тогда
			
			ДокументГлавный = ОтборДокумент;
			ДокументТитул = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ПоследнийПоДатеТитулЭТРН(ДокументГлавный); 
			
		ИначеЕсли ТипЗнч(ОтборДокумент) = Тип("ДокументСсылка.КонтурЛогистика_ЭлектронныйЗаказНаряд") Тогда
			
			ДокументГлавный = ОтборДокумент;
			ДокументТитул = Документы.КонтурЛогистика_ЭлектронныйЗаказНаряд.ПоследнийПоДатеТитул(ДокументГлавный);
			
		Иначе
			
			ДокументТитул = ОтборДокумент;
			ТипТитула = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПолучитьТипЛогистикаПоДокументуТитулу(ДокументТитул);
			
			Если ЗначениеЗаполнено(ТипТитула) Тогда
				
				Если Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоТРН(ТипТитула) Тогда
					ДокументГлавный = ДокументТитул.ДокументЭТРН;
				ИначеЕсли Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоПЛ(ТипТитула)
					Или Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоЗЗ(ТипТитула)
					Или Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоДФ(ТипТитула)
					Или Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоЭР(ТипТитула)
					Или Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоСР(ТипТитула)
					Или Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоПЭ(ТипТитула) Тогда
					
					Если ТипТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1
						Или ТипТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02
						Или ТипТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1
						Или ТипТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка
						Или ТипТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СкладскаяРасписка
						Или ТипТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1 Тогда
						
						ДокументГлавный = ДокументТитул;
					Иначе
						ДокументГлавный = ДокументТитул.Титул1;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ДокументТитул = Неопределено;
		ДокументГлавный = Неопределено;
		
	КонецЕсли;
	
	СписокТитул.Параметры.УстановитьЗначениеПараметра("ДокументТитул", ДокументТитул);
	СписокГлавный.Параметры.УстановитьЗначениеПараметра("ДокументГлавный", ДокументГлавный);

КонецПроцедуры

&НаКлиенте
Процедура ОтборДокументПриИзменении(Элемент)
	
	ОтборДокументПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокГлавныйДопИнформацияПоказать(Команда)
	
	Элементы.СписокГлавныйГруппаПодробно.Видимость = Не Элементы.СписокГлавныйГруппаПодробно.Видимость;
	
	ОбновитьКартинкиКомандПоказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКартинкиКомандПоказа()
	
	КартинкаПоказать = БиблиотекаКартинок.КонтурЛогистика_Показать;
	КартинкаСкрыть = БиблиотекаКартинок.КонтурЛогистика_Скрыть;
	
	Если Элементы.СписокГлавныйГруппаПодробно.Видимость Тогда
		Элементы.СписокГлавныйДопИнформацияПоказать.Картинка = КартинкаСкрыть;
	Иначе
		Элементы.СписокГлавныйДопИнформацияПоказать.Картинка = КартинкаПоказать;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокГлавныйВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "СписокГлавныйСостояние" Тогда
		ПоказатьЗначение(, Элементы.СписокГлавный.ТекущиеДанные.Состояние);
	ИначеЕсли Поле.Имя = "СписокГлавныйДокумент" Тогда
		ПоказатьЗначение(, Элементы.СписокГлавный.ТекущиеДанные.Документ);
	ИначеЕсли Поле.Имя = "СписокГлавныйФайлОбмена" Тогда
		ПоказатьЗначение(, Элементы.СписокГлавный.ТекущиеДанные.ФайлОбмена);
	КонецЕсли;
	
КонецПроцедуры
